app/views/tweets/_feed.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 8]]
---
                  <%= like_or_dislike_btn(tweet) %>
				  <strong><%= tweet.likes.count %></strong>