app/helpers/application_helper.rb

SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["tweet_id", 8], ["user_id", 4], ["LIMIT", 1]]
---
    def like_or_dislike_btn(tweet)
        like = Like.find_by(tweet: tweet, user: current_user)