app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["tweet_id", 7], ["created_at", "2021-09-23 21:17:21.060372"], ["updated_at", "2021-09-23 21:17:21.060372"]]
---
    def create
        @like = current_user.likes.new(tweet_id: params[:tweet_id])

        if @like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? AND "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["id", 1], ["user_id", 3], ["tweet_id", 7], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
      def destroy
        like = Like.find_by(id: params[:id], user: current_user, tweet_id: params[:tweet_id])
        if like
          like.destroy