app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order('created_at DESC')
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at DESC

  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("tweet", "created_at", "updated_at") VALUES (?, ?, ?)  [["tweet", "My 1st tweet\r\n"], ["created_at", "2021-08-18 21:45:05.768473"], ["updated_at", "2021-08-18 21:45:05.768473"]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "tweet" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["tweet", "I added this like button."], ["updated_at", "2021-09-23 23:26:36.882174"], ["id", 8]]